app/serializers/user_serializer.rb

SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = $1  [["user_id", 1]]
---
  def number_of_exps
    object.experiences.length