app/controllers/experiences_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        user = User.find_by(id: session[:user_id])

SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        experience = Experience.find(params[:id])

INSERT INTO "experiences" ("title", "activity", "description", "rating", "destination_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["activity", "test"], ["description", "test"], ["rating", 4], ["destination_id", 1], ["user_id", 1]]
---
    def create
        experience = Experience.create!(experience_params)