app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "location") VALUES ($1, $2, $3) RETURNING "id"  [["username", "ktk"], ["password_digest", "[FILTERED]"], ["location", "Boulder, CO"]]
---
    def create
        user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        if params[:id]
            render json: User.find(params[:id]), status: :ok, serializer: UserExperiencesSerializer

SELECT "users".* FROM "users"
---
    def index
        render json: User.all, status: :ok